Repository: sgm17/platonic-flutter
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# flatsTransportTitle
source: {minutes} min. to {simpleName}
ca: {minutes} min. a {simpleName}
es: {minutes} min. a {simpleName}

# step1NavigatorTitle
source: Step 1-4
ca: Pas 1-4
es: Paso 1-4

# step1ConfirmAddressButton
source: Confirm Address
ca: Confirmar Direcció
es: Confirmar Dirección

# step2NavigatorTitle
source: Step 2-4
ca: Pas 2-4
es: Paso 2-4

# step2Title
source: Flat Preferences
ca: Preferències del Pis
es: Preferencias del Piso

# step2RentPerMonthHintText
source: Rent per month
ca: Lloguer por mes
es: Alquiler por mes

# step2RentAdvanceHintText
source: Rent advance
ca: Lloguer por avanzado
es: Alquiler por avanzado

# step2CostElectricityHintText
source: Cost of electricity, water, gas and internet
ca: Cost de la llum, aigua, gas i internet
es: Coste de la luz, agua, gas e internet

# step2AvailableFromHintText
source: Available from {date}
ca: Disponible des de {date}
es: Disponible desde {date}

# step2SliderMaxText
source: Over 12 months
ca: Més de 12 mesos
es: Más de 12 meses

# step2SliderMinText
source: No minimum
ca: Sense mínim
es: Sin mínimo

# step2SliderLeftTitle
source: Minimum stay
ca: Estància mínima
es: Estancia mínima

# step2SliderRightTitle
source: No Min.
ca: Sense Mín.
es: Sin Mín.

# step2SliderRightTitleWithParam
source: Min. {months} mo.
ca: Mín. {months} mesos
es: Mín. {months} meses

# step2RoomTenantsTitle
source: Flat Tenants
ca: Inquilins del Pis
es: Inquilinos del Piso

# step2RoomTenantsSubtitle
source: Tenants
ca: Inquilins
es: Inquilinos

# step2NextButton
source: Next
ca: Següent
es: Siguiente

# step3NavigatorTitle
source: Step 3-4
ca: Pas 3-4
es: Paso 3-4

# step3Title
source: Flat Amenities
ca: Característiques del Pis
es: Características del Piso

# step3BedroomTitle
source: Bedrooms
ca: Habitacions
es: Habitaciones

# step3BathroomTitle
source: Bathrooms
ca: Banys
es: Baños

# step3BuiltTitle
source: Built
ca: Construït
es: Construido

# step3FloorTitle
source: Floor
ca: Pis
es: Piso

# step3FeaturesSubtitleTitle
source: Features
ca: Característiques
es: Características

# step3TransportationSubtitleTitle
source: Transportation
ca: Transport
es: Transporte

# step3FeaturesText
source: Select some features
ca: Seleccioneu algunes característiques
es: Selecciona algunas características

# step3TransportationHintText
source: 10 minutes
ca: 10 minuts
es: 10 minutos

# step3DisclaimerText
source: If you share a flat with students from other universities, adding them to the flat will also be published in their university and only you will keep the permissions
ca: Si comparteixes pis amb estudiants d'altres universitats i els afegeixes, també es publicarà a la seva universitat i només tu conservaràs els permisos
es: Si compartes piso con estudiantes de otras universidades y los añades, también se publicará en su universidad y solo tú conservarás los permisos

# step3NextButton
source: Next
ca: Següent
es: Siguiente

# step4NavigatorTitle
source: Step 4-4
ca: Pas 4-4
es: Paso 4-4

# step4Title
source: Ads Details
ca: Detalls de l'anuncio
es: Detalles del Anuncio

# step4TitleHintText
source: Provide a title
ca: Introdueix un títol
es: Introduce un título

# step4DescriptionHintText
source: Provide a description
ca: Introdueix una descripció
es: Introduce una descripción

# step4ImagesTitle
source: Flat Images
ca: Imatges del Piso
es: Imágenes del Piso

# step4ImagesSubtitle
source: (Max 20 photos)
ca: (Màxim 20 imatges)
es: (Máximo 20 imágenes)

# detailNavigatorTitle
source: Details
ca: Detalls
es: Detalles

# detailAmenitiesBedroom
source: {bedroom} bedrooms
ca: {bedroom} habitacions
es: {bedroom} habitaciones

# detailAmenitiesBathroom
source: {bathroom} bathrooms
ca: {bathroom} banys
es: {bathroom} baños

# detailAmenitiesBuilt
source: {built} m
ca: construïts {built} m

# detailAmenitiesFloor
source: {floor} floor
ca: pis {floor}
es: piso {floor}

# detailDisclaimerText
source: If you share a flat with students from other universities, add them
ca: Si comparteixes pis amb estudiants d'altres universitats, afegeix-los
es: Si compartes piso con estudiantes de otras universidades, añádelos

# detailFeaturesSubtitle
source: Features
ca: Característiques
es: Características

# detailFeaturesSeeAllTitle
source: See All
ca: Veure Tots
es: Ver Todos

# detailLocationSubtitle
source: Where youâ€™ll be
ca: On estaràs
es: Donde estarás

# detailDetailsSubtitle
source: Flat Details
ca: Detalls del Pis
es: Detalles del Piso

# detailCostSubtitle
source: Monthly Cost
ca: Cost Mensual
es: Coste Mensual

# detailPrincipalConceptTitle
source: Principal & Interest
ca: Principal i Interès
es: Principal e Interés

# detailElectricityConceptTitle
source: Cost of electricity, water, gas and internet
ca: Cost de la llum, aigua, gas i internet
es: Coste de la luz, agua, gas e internet

# detailFirstMonthConceptTitle
source: First month rent advance
ca: Primer mes de lloguer anticipat
es: Adelanto del primer mes de alquiler

# detailTransportationSubtitle
source: Transportation
ca: Transport
es: Transporte

# detailTransportationTitle
source: By {transportName} to {university} {minutes} minutes
ca: En {transportName} a {university} {minutes} minuts
es: En {transportName} a {university} {minutes} minutos

# detailPriceTitle
source: Price
ca: Preu
es: Precio

# detailPricePerMonthText
source: /month
ca: /mes
es: /mes

# detailContactButton
source: Contact
ca: Contacte
es: Contacto

# featuresCreateNavigatorTitle
source: Features
ca: Característiques
es: Características

# featuresListNavigatorTitle
source: Features
ca: Característiques
es: Características

# directions_train
source: Train
ca: Tren
es: Tren

# directions_car
source: Car
ca: Coche
es: Coche

# directions_walk
source: Walk
ca: Cames
es: Pata

# feature_air_conditioning
source: Air Conditioning
ca: Aire Condicionat
es: Aire Acondicionado

# feature_heating
source: Heating
ca: Calefacció
es: Calefacción

# feature_closet
source: Closet
ca: Armari
es: Armario

# feature_dishwasher
source: Dishwasher
ca: Rentaplats
es: Lavavajillas

# feature_microwave
source: Microwave
ca: Microones
es: Microondas

# feature_oven
source: Oven
ca: Forn
es: Horno

# feature_refrigerator
source: Refrigerator
ca: Nevera
es: Nevera

# feature_smoke
source: No Smoke
ca: Sense Fum
es: Sin Humo

# feature_elevator
source: Elevator
ca: Ascensor
es: Ascensor

# feature_garage
source: Garage
ca: Garatge
es: Garaje

# feature_laundry
source: Laundry
ca: Rentadora
es: Lavadora

# feature_furnitures
source: Furnitures
ca: Mobles
es: Muebles

# feature_gym
source: Gym
ca: Gimnàs
es: Gimnasio

# feature_pool
source: Pool
ca: Piscina
es: Piscina

# feature_balcony
source: Balcony
ca: Balcó
es: Balcón

# feature_local_library
source: Local Library
ca: Biblioteca Local
es: Biblioteca Local

# feature_terrace
source: Terrace
ca: Terrasa
es: Terraza

# error_dialog_retry
source: Retry
ca: Reintentar
es: Reintentar

# delete_dialog_cancel
source: Cancel
ca: Cancel·lar
es: Cancelar

# delete_dialog_confirm
source: Delete
ca: Eliminar
es: Eliminar

# detailTenantHintText
source: hello@gmail.com
es: hola@gmail.com
