Repository: sgm17/platonic-flutter
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# invalidemail
source: The email address is malformed or is not valid
ca: L'adreça de correu està mal formada o no és vàlida
es: La dirección de correo está mal formada o no es válida

# userdisabled
source: Your account has been disabled
ca: El teu compte ha estat deshabilitat
es: Tu cuenta ha sido deshabilitada

# usernotfound
source: The user account has not been found
ca: No s'ha trobat el compte d'usuari
es: No se ha encontrado la cuenta de usuario

# wrongpassword
source: The password is incorrect
ca: La contrasenya és incorrecte
es: La contraseña es incorrecta

# emailalreadyinuse
source: The email address is already associated with an existing user account
ca: L'adreça de correu ja està associada amb un compte d'usuari existent
es: La dirección de correo ya está asociada con una cuenta de usuario existente

# operationnotallowed
source: This operation is not allowed
ca: Aquesta operació no està permesa

# weakpassword
source: The password is too weak
ca: La contrasenya és massa feble
es: La contraseña es demasiado débil

# credentialalreadyinuse
source: The email address is already associated with an existing user account
ca: L'adreça de correu ja està associada amb un compte d'usuari existent
es: La dirección de correo ya está asociada con una cuenta de usuario existente

# invalidcredential
source: The credential is malformed or is not valid
ca: La credencial està mal formada o no és vàlida
es: La credencial está mal formada o no es válida

# accountexistswithdifferentcredential
source: The email is already associated with an existing user account, but with a different authentication provider
ca: El correu ja està associat amb un compte d'usuari existent, però amb un proveïdor d'autenticació diferent
es: El correo ya está asociado con una cuenta de usuario existente, pero con un proveedor de autenticación diferente

# requiresrecentlogin
source: You must have to sign again to perform the operation
ca: Has de tornar a iniciar sessió per a realitzar l'operació
es: Debes volver a iniciar sesión para realizar la operación

# provideralreadylinked
source: The authentication provider is already linked to you account
ca: El proveïdor d'autenticació ja està vinculat al vostre compte
es: El proveedor de autenticación ya está vinculado a su cuenta

# nosuchprovider
source: This authentication provider is not enabled
ca: Aquest proveïdor d'autenticació no està habilitat
es: Este proveedor de autenticación no está habilitado

# invalidverificationcode
source: The verification code is invalid or has expired
ca: El codi de verificació no és vàlid o ha caducat
es: El código de verificación no es válido o ha caducado

# invalidverificationid
source: The verification ID is invalid
ca: L'ID de verificació no és vàlid
es: El ID de verificación no es válido

# missingverificationcode
source: The verification code is missing
ca: Manca el codi de verificació
es: Falta el código de verificación

# quotaexceeded
source: The maximum number of SMS messages has been exceeded
ca: S'ha superat el nombre màxim de missatges SMS
es: Se ha superado el número máximo de mensajes SMS

# sessionexpired
source: Your session has been expired
ca: La teva sessió s'ha acabat
es: Tu sesión ha terminado

# internalerror
source: An internal error occurred while processing the request
ca: Ha passat un error intern en processar la sol·licitud
es: Ocurrió un error interno al procesar la solicitud

# httpindexuniversities
source: Unexpected error retrieving list of universities
ca: Error inesperat en recuperar la llista d'universitats
es: Error inesperado al recuperar la lista de universidades

# httpindexappuser
source: Unexpected error retrieving the user
ca: Error inesperat en recuperar l'usuari
es: Error inesperado al recuperar el usuario

# httpshowappuser
source: Unexpected error retrieving the other user
ca: Error inesperat en recuperar l'altre usuari
es: Error inesperado al recuperar el otro usuario

# httpcreateappuser
source: Unexpected error creating the user
ca: Error inesperat en crear l'usuari
es: Error inesperado al crear el usuario

# httpupdateappuser
source: Unexpected error updating the user
ca: Error inesperat en actualitzar l'usuari
es: Error inesperado al actualizar el usuario

# httpdestroyappuser
source: Unexpected error deleting the user
ca: Error inesperat en eliminar l'usuari
es: Error inesperado al eliminar el usuario

# httpupdatecloudtokenappuser
source: Unexpected error updating the cloud token
ca: Error inesperat en actualitzar el token del núvol
es: Error inesperado al actualizar el token de la nube

# httpindexmeet
source: Unexpected error retrieving the meets
ca: Error inesperat en recuperar els meets
es: Error inesperado al recuperar los meets

# httpdestroymeet
source: Unexpected error deleting the meet
ca: Error inesperat en eliminar el meet
es: Error inesperado al eliminar el meet

# httpindexstories
source: Unexpected error retrieving the stories
ca: Error inesperat en recuperar les històries
es: Error inesperado al recuperar las historias

# httpshowstories
source: Unexpected error retrieving the faculty stories
ca: Error inesperat en recuperar les històries de la facultat
es: Error inesperado al recuperar las historias de la facultad

# httpcreatestories
source: Unexpected error creating the story
ca: Error inesperat en crear la història
es: Error inesperado al crear la historia

# httpspamtories
source: You have already published the maximum of daily stories that are 2
ca: Ja has publicat el màxim nombre d'històries diàries que són 2
es: Ya has publicado el máximo de historias diarias que son 2

# httpfavouritestories
source: Unexpected error favouring the story
ca: Error inesperat en marcar com a preferit la història
es: Error inesperado al marcar como favorito la historia

# httpdeletestories
source: Unexpected error deleting the story
ca: Error inesperat en eliminar la història
es: Error inesperado al eliminar la historia

# httpindexconversations
source: Unexpected error retrieving all the conversations
ca: Error inesperat en recuperar totes les conversacions
es: Error inesperado al recuperar todas las conversaciones

# httpdestroyconversations
source: Unexpected error deleting the conversation
ca: Error inesperat en eliminar la conversació
es: Error inesperado al eliminar la conversación

# httpcreatevisualization
source: Unexpected error marking the story as viewed
ca: Error inesperat en marcar la història como vista
es: Error inesperado al marcar la historia como vista

# httpcreateimage
source: Unexpected error uploading the image to the server
ca: Error inesperat en pujar la imatge al servidor
es: Error inesperado al subir la imagen al servidor

# httpcreatemultipleimages
source: Unexpected error uploading the images to the server
ca: Error inesperat en pujar les imatges al servidor
es: Error inesperado al subir las imágenes al servidor

# httpdeleteflat
source: Unexpected error deleting the flat
ca: Error inesperat en eliminar el pis
es: Error inesperado al eliminar el piso

# httpindexflats
source: Unexpected error retrieving all the flats
ca: Error inesperat en recuperar tots els pisos
es: Error inesperado al recuperar todos los pisos

# httphomeflat
source: Unexpected error retrieving the home flat
ca: Error inesperat en recuperar el piso d'inici
es: Error inesperado al recuperar el piso de inicio

# httpshowflat
source: Unexpected error retrieving the detailed flat
ca: Error inesperat en recuperar el piso detallat
es: Error inesperado al recuperar el piso detallado

# httpposttenant
source: Unexpected error adding a new tenant to the flat
ca: Error inesperat en afegir un nou inquilí al pis
es: Error inesperado al añadir un nuevo inquilino al piso

# httpbookmark
source: Unexpected error saving the flat
ca: Error inesperat en guardar el pis
es: Error inesperado al guardar el piso

# httpcreateflat
source: Unexpected error creating the flat
ca: Error inesperat en crear el pis
es: Error inesperado al crear el piso

# httpcreateflatspam
source: You have already published the maximum number of daily flats, which is 1
ca: Ja tens publicat el nombre màxim de pisos diaris, que és 1
es: Ya tienes publicado el número máximo de pisos diarios, que es 1

# httpupdateflat
source: Unexpected error updating the flat
ca: Error inesperat en actualitzar el pis
es: Error inesperado al actualizar el piso

# httpaddress
source: Unexpected error retrieving the addresses
ca: Error inesperat en recuperar les direccions
es: Error inesperado al recuperar las direcciones

# meetdeletedialog
source: Are you sure you want to delete the meet?
ca: Segur que vols eliminar el meet?
es: ¿Estás seguro de que quieres eliminar el meet?

# conversationdeletedialog
source: Are you sure you want to delete the conversation?
ca: Segur que vols eliminar la conversació?
es: ¿Estás seguro de que quieres eliminar la conversación?

# storydeletedialog
source: Are you sure you want to delete the story?
ca: Segur que vols eliminar la història?
es: ¿Estás seguro de que quieres eliminar la historia?

# flatdeletedialog
source: Are you sure you want to delete the flat?
ca: Segur que vols eliminar el pis?
es: Estás seguro de que quieres eliminar el piso?

# imagedeletedialog
source: Are you sure you want to delete the image?
ca: Segur que vols eliminar la imatge?
es: Estás seguro de que quieres eliminar la imagen?

# userloadingdialog
source: Wait while user is updated
ca: Espera mentre l'usuari s'està actualitzant
es: Espera mientras el usuario se está actualizado

# settingsloadingdialog
source: Wait while settings are updated
ca: Espera mentre s'actualitza la configuració
es: Espera mientras se actualiza la configuración

# imageloadingdialog
source: Wait while the image finishes loading
ca: Espera mentre la imatge acaba de carregar-se
es: Espera mientras la imagen termina de cargarse

# imagesloadingdialog
source: Wait while the images finish loading
ca: Espera mentre les imatges acaben de carregar-se
es: Espera mientras las imágenes terminan de cargarse

# registeruniversitydialog
source: Your university or the university to meet cannot be empty
ca: La teva universitat o la universitat del meet no poden estar buides
es: Tu universidad o la universidad del meet no pueden estar vacías

# registerfacultydialog
source: Your faculty or the faculties to meet cannot be empty
ca: La teva facultat o les facultats del meet no poden estar buides
es: Tu facultad o las facultades del meet no pueden estar vacías

# registerstudydialog
source: Your studies cannot be empty
ca: Els teus estudis no poden estar buits
es: Tus estudios no pueden estar vacíos

# registernamerequireddialog
source: Your name cannot be empty
ca: El teu nom no pot estar buit
es: Tu nombre no puede estar vacío

# registernameonlylettersdialog
source: Your name can only contain letters
ca: El teu nom només pot contenir lletres
es: Tu nombre solo puede contener letras

# authemptyemaildialog
source: Your email cannot be empty
ca: El teu correu no pot estar buit
es: Tu correo no puede estar vacío

# authvalidemaildialog
source: The email introduced does not have a valid structure
ca: El correu introduït no té una estructura vàlida
es: El email introducido no tiene una estructura válida

# authemptypasswordialog
source: Your password cannot be empty
ca: La teva contrasenya no pot ser buida
es: Tu contraseña no puede estar vacía

# authshortpasswordialog
source: The password introduced must be at least 6 characters long
ca: La contrasenya introduïda ha de tenir almenys 6 caràcters
es: La contraseña introducida debe tener al menos 6 caracteres

# step1emptyaddress
source: The address cannot be empty
ca: La direcció no pot estar buida
es: La dirección no puede estar vacía

# step2rentpermonth
source: The rent per month is required
ca: Lloguer per mes és requerit
es: Se requiere el alquiler por mes

# step2rentvalid
source: The rent per month must be an integer between 1 and 1999
ca: El lloguer per mes ha de ser un nombre enter entre 1 i 1999
es: El alquiler por mes debe ser un número entero entre 1 y 1999

# step2rentadvance
source: The rent advance is required
ca: L'avançament del lloguer és requerit
es: El adelanto del alquiler es requerido

# step2rentadvancevalid
source: The rent advance must be an integer between 0 and 1999
ca: L'avançament del lloguer ha de ser un nombre enter entre 0 i 1999
es: El adelanto del alquiler debe ser un número entero entre 0 y 1999

# step2costelectricity
source: The cost of electricity is required
ca: El cost de la llum és requerit
es: El coste de la luz es requerido

# step2electricityvalid
source: The cost of electricity must be an integer between 0 and 1999
ca: El cost de la llum ha de ser un nombre enter entre 0 i 1999
es: El coste de la luz debe ser un número entero entre 0 y 1999

# step2availablefromempty
source: It is necessary to provide an availability date
ca: És necessari proporcionar una data de disponibilitat
es: Es necesario proporcionar una fecha de disponibilidad

# step2dateformat
source: The date has an invalid format
ca: La data té un format invàlid
es: La fecha tiene un formato inválido

# step2datefuture
source: The date must be in the future
ca: La data ha de ser en el futur
es: La fecha debe ser en el futuro

# step2dateyear
source: The date must be within the next year
ca: La data ha de ser dins del proper any
es: La fecha debe ser dentro del próximo año

# step3built
source: The square meters of the flat are required
ca: Els metres quadrats del pis són requerits
es: Los metros cuadrados del piso son requeridos

# step3builtnegative
source: The square meters are not a valid number
ca: Els metres quadrats no són un nombre vàlid
es: Los metros cuadrados no son un número válido

# step3floor
source: The floor of the flat is required
ca: La planta del pis és requerida
es: La planta del piso es requerida

# step3floornegative
source: The floor is not a valid number
ca: La planta del pis no és un nombre vàlid
es: La planta del piso no es un número válido

# step3featuresshort
source: The features of the flat must be at least of 5
ca: Les característiques del pis han de ser almenys de 5
es: Las características del piso deben ser al menos de 5

# step3transportation
source: The minutes of the trip are required
ca: Els minuts del viatge són requerits
es: Los minutos del viaje son requeridos

# step3transportationvalid
source: The minutes of the trip must be greater than 0 and less than 240
ca: Els minuts del viatge han de ser més grans que 0 i menors que 240
es: Los minutos del viaje deben ser mayores que 0 y menores que 240

# step4adtitle
source: The title is required
ca: El títol és requerit
es: El título es requerido

# step4adtitleshort
source: The title must be at least 5 characters
ca: El títol ha de ser com a mínim de 5 caràcters
es: El título tiene que ser por lo menos de 5 caracteres

# step4addescription
source: The description is required
ca: La descripció és requerida
es: La descripción es requerida

# step4addescriptionshort
source: The description must be at least 20 characters long
ca: La descripció ha de tenir almenys 20 caràcters
es: La descripción debe tener al menos 20 caracteres

# step4emptyimages
source: At least one image is required
ca: Es requereix almenys una imatge
es: Se requiere al menos una imagen

# registerTitle
source: Get your free account
ca: Aconsegueix el teu compte gratis
es: Consigue tu cuenta gratis

# oauthAppleText
source: Continue with Apple
ca: Continua amb Apple
es: Continua con Apple

# oauthGoogleText
source: Continue with Google
ca: Continua amb Google
es: Continua con Google

# registerEmailTitle
source: Email
ca: Correu
es: Correo

# registerPasswordTitle
source: Password
ca: Contrasenya
es: Contraseña

# registerContinueButton
source: Continue With Email
ca: Continua amb el Correu
es: Continua con el Correo

# emailAuthInputHintText
source: hello@example.com
ca: hola@example.com
es: hola@example.com

# passwordAuthInputHintText
source: Your password
ca: La teva contrasenya
es: Tu contraseña

# authDividerText
source: OR
ca: O
es: O

# registerAlreadyAccountText
source: Already have an account
ca: Ja tinc un compte
es: Ya tengo una cuenta

# registerAlreadyAccountLoginText
source: Login
ca: Iniciar Sessió
es: Iniciar Sesión

# loginTitle
source: Log in to Platonic
ca: Inicia Sessió a Platonic
es: Inicia Sesión en Platonic

# loginFormEmailTitle
source: Email
ca: Correu
es: Correo

# loginFormPasswordTitle
source: Password
ca: Contrasenya
es: Contraseña

# loginForgotPasswordText
source: Forgot Password?
ca: Has oblidat la teva contrasenya?
es: ¿Has olvidado tu contraseña?

# loginLoginButton
source: Login
ca: Iniciar Sessió
es: Iniciar Sesión

# loginDontHaveAccountText
source: Don't have an account
ca: No tinc un compte
es: No tengo una cuenta

# loginDontHaveAccountSignupText
source: Register
ca: Registrar-se
es: Registrarse

# forgotPasswordTitle
source: Forgot Password?
ca: Has oblidat la teva contrasenya?
es: ¿Has olvidado tu contraseña?

# forgotPasswordInstructionsText
source: Enter your registered email below to receive password reset instruction
ca: Introduïu el vostre correu per rebre instruccions de restabliment de contrasenya
es: Ingrese su correo para recibir instrucciones de restablecimiento de contraseña

# forgotPasswordEmailTitle
source: Email
ca: Correu
es: Correo

# forgotPasswordEmailInputHintText
source: hello@example.com
ca: hola@example.com
es: hola@example.com

# forgotPasswordSendEmailButton
source: Send Email
ca: Enviar Correu
es: Enviar Correo

# forgotPasswordRememberText
source: Remember password?
ca: Recordes la contrasenya?
es: ¿Recuerdas la contraseña?

# forgotPasswordRememberLoginText
source: Login
ca: Iniciar Sessió
es: Iniciar Sesión

# verifyTitle
source: Email Verification
ca: Verificació de Correu
es: Verificación de Correo

# verifyInstructionsText
source: We have sent a verification message to your email: {hiddenEmail}
ca: Hem enviat un missatge de verificació al vostre correu: {hiddenEmail}
es: Hemos enviado un mensaje de verificación a su correo: {hiddenEmail}

# verifyMessageNotReceivedText
source: Didn't receive the email?
ca: No has rebut el correu?
es: ¿No recibiste el correo?

# verifyMessageNotReceivedResendText
source: Resend
ca: Reenviar
es: Reenviar

# verifyAccountButton
source: Verify Account
ca: Verificar el compte
es: Verificar la cuenta

# registerDetailPersonalTitle
source: Personal Information
ca: Informació Personal
es: Información Personal

# registerDetailPersonalNameTitle
source: Name
ca: Nom
es: Nombre

# registerDetailPersonalNameInputHintText
source: Your name
ca: El teu nom
es: Tu nombre

# registerDetailPersonalAgeTitle
source: Age
ca: Edat
es: Edad

# registerDetailPersonalAgeInputHintText
source: Your age
ca: La teva edat
es: Tu edad

# registerDetailPersonalSwitchTitle
source: Sex
ca: Sexe
es: Sexo

# registerDetailPersonalSwitchManText
source: Man
ca: Home
es: Hombre

# registerDetailPersonalSwitchWomanText
source: Woman
ca: Dona
es: Mujer

# registerDetailPersonalUniversityPlaceholderText
source: Your university
ca: La teva universitat
es: Tu universidad

# registerDetailPersonalFacultyPlaceholderText
source: Your faculty
ca: La teva facultat
es: Tu facultad

# registerDetailPersonalStudiesPlaceholderText
source: Your studies
ca: Els teus estudis
es: Tus estudios

# registerDetailMeetTitle
source: Meet Settings
ca: Ajustaments de Meet
es: Ajustes de Meet

# registerDetailMeetUniversityPlaceholderText
source: Your university to meet
ca: La teva universitat de meet
es: Tu universidad de meet

# registerDetailMeetUniversityTtitle
source: University to meet
ca: Universitat de meet
es: Universidad de meet

# registerDetailMeetFacultiesPlaceholderText
source: Your faculties to meet
ca: Les teves facultats de meet
es: Tus facultades de meet

# registerDetailMeetFacultiesTitle
source: Faculties to meet
ca: Facultat de meet
es: Facultad de meet

# registerDetailMeetDescriptionText
source: Meet is a functionality that automatically matches you with a person of your choice every day at 3 pm
ca: Meet és una funcionalitat que t'aparella automàticament amb una persona de la teva elecció cada dia a les 3 pm
es: Meet es una funcionalidad que te empareja automáticamente con una persona de tu elección todos los días a las 3 pm

# registerDetailFinishRegisterButton
source: Finish the Register
ca: Acaba el Registre
es: Termina el Registro

# startTitle
source: Find New Friends With Platonic
ca: Fes Nous Amics Amb Platonic
es: Haz Nuevos Amigos Con Platonic

# startSubtitle
source: With the Meet functionality you can meet a new person of your choice every day at 3 pm
ca: Amb la funcionalitat Meet tu pots conèixer una persona de la teva elecció cada dia a las 3 pm
es: Con la funcionalidad Meet tu puedes conocer a una persona de tu elección cada día a las 3 pm

# startGetStartedButton
source: Get Started
ca: Comença
es: Empieza

# homeStoriesTitle
source: Stories
ca: Històries
es: Historias

# homeMeetDisclaimer
source: Maybe this Meet is waiting for you at 3 pm
ca: Potser aquest Meet t'està esperant a las 3 pm
es: Quizás este Meet te está esperando a las 3 pm

# homeFlatsTitle
source: Flats
ca: Pisos
es: Pisos

# homeFlatsSeeAllTitle
source: See All
ca: Veure Tots
es: Ver Todos

# homeMessagesTitle
source: Messages
ca: Missatges
es: Mensajes

# flatHomeBedroom
source: {bedroom} bedrooms
ca: {bedroom} habitacions
es: {bedroom} habitaciones

# flatHomeBathroom
source: {bathroom} bathrooms
ca: {bathroom} banys
es: {bathroom} baños

# flatHomePerMonthText
source: / per month
ca: / per mes
es: / por mes

# profileMeetPictureTitle
source: Meet Picture
ca: Imatge de Meet
es: Imagen de Meet

# otherProfileMeetPictureTitle
source: Meet Picture
ca: Imatge de Meet
es: Imagen de Meet

# settingsTitle
source: Meet Settings
ca: Ajustaments de Meet
es: Ajustes de Meet

# settingsSwitchTitle
source: Active
ca: Actiu
es: Activo

# settingsSexToMeetTitle
source: Sex to meet
ca: Sexe de meet
es: Sexo de meet

# settingsSexToMeetManText
source: Man
ca: Home
es: Hombre

# settingsSexToMeetWomanText
source: Woman
ca: Dona
es: Mujer

# settingsLogoutButton
source: Log out
ca: Tancar Sessió
es: Cerrar Sesión

# createHintText
source: Tap to write
ca: Toca per escriure
es: Toca para escribir

# createBottomText
source: STORY
ca: HISTÒRIA
es: HISTORIA

# createFacultyText
source: Your faculty
ca: La teva facultat
es: Tu facultad

# storyHintText
source: Enter a message
ca: Introdueix un missatge
es: Introduce un mensaje

# storyVisualizationText
source: Saw by {totalViewers}
ca: Vist por {totalViewers}
es: Visto por {totalViewers}

# storyDotsMenuText
source: Delete Story
ca: Eliminar Història
es: Eliminar Historia

# chatDotsMenuText
source: Delete Chat
ca: Eliminar Xat
es: Eliminar Chat

# chatInputHintText
source: Enter a message
ca: Introdueix un missatge
es: Introduce un mensaje

# universityDialogMeetTitle
source: Set university to Meet
ca: Estableix universitat de Meet
es: Establece universidad de Meet

# universityDialogPersonalTitle
source: Set your university
ca: Estableix la teva universitat
es: Establece tu universidad

# universityDialogSearchPlaceholder
source: Search by university
ca: Busca per universidad
es: Busca por universidad

# facultyDialogMeetTitle
source: Set faculties to Meet
ca: Estableix facultats de Meet
es: Establece facultades de Meet

# facultyDialogPersonalTitle
source: Set your faculty
ca: Estableix la teva facultat
es: Establece tu facultad

# facultyDialogSearchPlaceholder
source: Search by faculty
ca: Busca per facultat
es: Busca por facultad

# studyDialogPersonalTitle
source: Set your study
ca: Estableix els teus estudis
es: Establece tus estudios

# studyDialogSearchPlaceholder
source: Search by study
ca: Busca per estudis
es: Busca por estudios

# flatsSearchPlaceholder
source: Search by city
ca: Busca per ciutat
es: Busca por ciudad
